<template>
  <div class="cp-padding-2x right-align">
    <header class="cp-b-margin font-bold p-text font-22">قوانین و شرایط استفاده</header>
    <ul>
      <li :dir="$dir()" class="cp-b-margin" v-for="(term, index) in terms" :key="index"><span class="font-norm font-18 p-text">{{index+1}}. </span> {{term}}</li>
    </ul>
  </div>
</template>

<script>
  export default {
    data() {
      return {
        terms: [
          ' کافه پی در چارچوب قوانین جمهوری اسلامی ایران فعالیت می کند و شما متعهد می شوید از هرگونه استفاده مغایر قانون از این برنامه خودداری کنید',
          'کاربران با ثبت نام در کافه پی و همچنین با هر بار استفاده از خدمات کافه پی می‌پذیرند که قوانین و مقررات جاری کافه پی را به صورت کامل مطالعه کرده و با اطلاع کامل از شرایط و معانی آن پذیرفته‌اند. این قوانین و مقررات ممکن است در طول زمان تغییرکند و بنابراین استفادۀ مستمر کاربران از نرم افزار به معنی پذیرش هرگونه تغییر در قوانین و مقررات آن است',
          'استفاده از نام و نام‌خانوادگی حقیقی افراد به منظور ثبت‌نام در سایت الزامی است. در صورت مشاهده کلمات رکیک و الفاظ نامناسب، حساب كاربر حذف خواهد شد',
          'کد فعالسازی امکان استفاده از نرم افزار را برای شما فراهم می‌آورد. به منظور جلوگیری از سوء استفاده اشخاص ثالث، از افشای آن خودداری کنید. در صورتی که کد فعالسازی در اختیار اشخاص دیگر قرار گیرد، مسئولیت آن بر عهده شما خواهد بود',
          'لازم است هنگام معرفی حساب بانکی و همچنین انجام تراکنش، مشخصات به دقت بررسی نموده و از صحت مندرجات آن اطمینان حاصل کنید. مسئولیت پرداخت اشتباه ناشی از اعلام مشخصات نادرست بر عهده شما خواهد بود. کاربر متعهد می شود تنها نسخه اصلی و دستکاری نشده برنامه را از طریق وب سایت کافه پی و یا لینک های معرفی شده در آن استفاده کند. کافه پی مسوولیتی در قبال مشکلات ناشی از نسخه های متفرقه که از طریق منابع دیگر استفاده می‌شود ندارد',
          ' چنانچه معرفی حساب بانکی و یا تراکنش آن مشمول مقررات پولشویی، یا درآمد ناشی از ربا و یا هر وصف کیفری دیگری باشد، مسئولیت آن بر عهده کاربر و پرداخت کننده می باشد',
          ' در صورتی که از کاربری شکایت شود و سواستفاده آن کاربر محرز شود، کافه پی آن حساب کاربری و مبالغ پرداخت شده را تا اعلام تصمیم مراجع ذیصلاح مسدود می نماید',
          'در صورت بروز هرگونه خطا نسبت به درج قیمت و ارزش ریالی کالاهای موجود در سایت لاویا، حق بلا اثر نمودن سفارش و خرید انجام شده توسط مشتری، برای لاویا محفوظ است. لاویا در اسرع وقت وجوه دریافتی را به پرداخت شده طی 24 الی 72 ساعت کاری به حساب اعلام شده توسط مشتری واریز و عودت می‌نماید و مشتری با ورود به سایت لاویا می‌پذیرد از این امر آگاهی داشته و در این خصوص ادعایی نخواهد داشت',
          'قیمت و موجودی کالا و خدمات موجود در کافه پی توسط پذیرندگان کافه پی تعیین می شود و در صورت بروز هرگونه خطا نسبت به درج قیمت و یا موجودی کالا، کافه پی سفارش و خرید انجام شده توسط مشتری را بلااثر نموده و در اسرع وقت وجوه دریافتی را به کیف پول یا حساب بانکی کاربر عودت می نمای',
        ]
      }
    },
  }
</script>

<style scoped lang="sass">
  li
    letter-spacing: -0.025rem
</style>